Revit 2024 API
MasonryCMU.MasonryCMUColorByObject Property
 The property labeled "Color By Object" from the "MasonryCMU" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string MasonryCMUColorByObject { get; }
Visual Basic
Public Shared ReadOnly Property MasonryCMUColorByObject As String
	Get
Visual C++
public:
static property String^ MasonryCMUColorByObject {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
MasonryCMU Class
Autodesk.Revit.DB.Visual Namespace